harviswang/linux-3.10.99/arch/mips/m200/driverlib/gpio.c
//*****************************************************************************
//
// gpio.c - Driver for the GPIO.
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include "../inc/hw_gpio.h"
#include "../inc/hw_memmap.h"
#include "gpio.h"
#include "intc.h"
#include "debug.h"

//*****************************************************************************
//
// A mapping of GPIO base address to interupt number.
//
//*****************************************************************************
static const unsigned long g_ppulGPIOIntMap[][2] =
{
    { GPIOA_BASE, IRQ_NO_GPIO0 },
    { GPIOB_BASE, IRQ_NO_GPIO1 },
    { GPIOC_BASE, IRQ_NO_GPIO2 },
    { GPIOD_BASE, IRQ_NO_GPIO3 },
    { GPIOE_BASE, IRQ_NO_GPIO4 },
    { GPIOF_BASE, IRQ_NO_GPIO5 },
};

//*****************************************************************************
//
//! \internal
//! Checks a GPIO base address.
//!
//! \param ulBase is the base address of the GPIO port.
//!
//! This function determines if a GPIO port base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
GPIOBaseValid(unsigned long ulBase)
{
    return((ulBase == GPIOA_BASE) ||
           (ulBase == GPIOB_BASE) ||
           (ulBase == GPIOC_BASE) ||
           (ulBase == GPIOD_BASE) ||
           (ulBase == GPIOE_BASE) ||
           (ulBase == GPIOF_BASE));
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a GPIO pin number.
//!
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function determines if a GPIO pin number is valid, [0, 31].
//!
//! \return Returns \b true if the pin number is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
tBoolean
GPIOPinNumberValid(unsigned long ulPinNumber)
{
    return(ulPinNumber <= 31 );
}
#endif

//*****************************************************************************
//
//! \internal
//!  Get GPIO group id.
//!
//! \param ulBase is the base of the GPIO port.
//!
//! This function gets the group id of GPIO port.
//!
//! \return Returns group id[0, 6] if success, return -1 ([7, 0xF]) when failed
//
//*****************************************************************************
static long
GPIOGroupIDGet(unsigned long ulBase)
{
    unsigned long ulGroupID;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));

    ulGroupID = (ulBase >> 8) & 0xF;
    if (ulGroupID < 7) {
        return(ulGroupID);
    } else {
        return(-1);
    }
}

//*****************************************************************************
//
//! Disable(Mask) a GPIO interrupt.
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function mask a gpio interrupt.
//!
//! \return Returns \b true if mask operation is success and \b false
//! otherwise.
//
//*****************************************************************************
tBoolean
GPIOInterruptDisable(unsigned long ulBase, unsigned long ulPinNumber)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    switch (ulPinNumber) {
    case 0:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS0;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK0) == GPIO_MASK_MASK0);
    case 1:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS1;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK1) == GPIO_MASK_MASK1);
    case 2:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS2;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK2) == GPIO_MASK_MASK2);
    case 3:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS3;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK3) == GPIO_MASK_MASK3);
    case 4:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS4;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK4) == GPIO_MASK_MASK4);
    case 5:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS5;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK5) == GPIO_MASK_MASK5);
    case 6:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS6;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK6) == GPIO_MASK_MASK6);
    case 7:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS7;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK7) == GPIO_MASK_MASK7);
    case 8:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS8;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK8) == GPIO_MASK_MASK8);
    case 9:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS9;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK9) == GPIO_MASK_MASK9);
    case 10:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS10;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK10) == GPIO_MASK_MASK10);
    case 11:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS11;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK11) == GPIO_MASK_MASK11);
    case 12:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS12;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK12) == GPIO_MASK_MASK12);
    case 13:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS13;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK13) == GPIO_MASK_MASK13);
    case 14:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS14;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK14) == GPIO_MASK_MASK14);
    case 15:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS15;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK15) == GPIO_MASK_MASK15);
    case 16:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS16;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK16) == GPIO_MASK_MASK16);
    case 17:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS17;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK17) == GPIO_MASK_MASK17);
    case 18:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS18;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK18) == GPIO_MASK_MASK18);
    case 19:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS19;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK19) == GPIO_MASK_MASK19);
    case 20:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS20;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK20) == GPIO_MASK_MASK20);
    case 21:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS21;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK21) == GPIO_MASK_MASK21);
    case 22:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS22;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK22) == GPIO_MASK_MASK22);
    case 23:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS23;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK23) == GPIO_MASK_MASK23);
    case 24:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS24;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK24) == GPIO_MASK_MASK24);
    case 25:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS25;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK25) == GPIO_MASK_MASK25);
    case 26:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS26;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK26) == GPIO_MASK_MASK26);
    case 27:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS27;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK27) == GPIO_MASK_MASK27);
    case 28:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS28;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK28) == GPIO_MASK_MASK28);
    case 29:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS29;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK29) == GPIO_MASK_MASK29);
    case 30:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS30;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK30) == GPIO_MASK_MASK30);
    case 31:
        HWREG(ulBase + GPIO_O_MASKS) |= GPIO_MASKS_MASKS31;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK31) == GPIO_MASK_MASK31);
    default:
        break;
    }

    return(false);
}

//*****************************************************************************
//
//! Enable(Unmask) a GPIO interrupt.
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function clear gpio interrupt mask.
//!
//! \return Returns \b true if the unmask operation is success and \b false
//! otherwise.
//
//*****************************************************************************
tBoolean
GPIOInterruptEnable(unsigned long ulBase, unsigned long ulPinNumber)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    switch (ulPinNumber) {
    case 0:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC0;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK0) == GPIO_MASK_MASK0);
    case 1:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC1;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK1) == GPIO_MASK_MASK1);
    case 2:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC2;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK2) == GPIO_MASK_MASK2);
    case 3:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC3;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK3) == GPIO_MASK_MASK3);
    case 4:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC4;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK4) == GPIO_MASK_MASK4);
    case 5:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC5;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK5) == GPIO_MASK_MASK5);
    case 6:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC6;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK6) == GPIO_MASK_MASK6);
    case 7:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC7;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK7) == GPIO_MASK_MASK7);
    case 8:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC8;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK8) == GPIO_MASK_MASK8);
    case 9:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC9;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK9) == GPIO_MASK_MASK9);
    case 10:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC10;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK10) == GPIO_MASK_MASK10);
    case 11:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC11;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK11) == GPIO_MASK_MASK11);
    case 12:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC12;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK12) == GPIO_MASK_MASK12);
    case 13:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC13;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK13) == GPIO_MASK_MASK13);
    case 14:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC14;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK14) == GPIO_MASK_MASK14);
    case 15:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC15;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK15) == GPIO_MASK_MASK15);
    case 16:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC16;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK16) == GPIO_MASK_MASK16);
    case 17:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC17;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK17) == GPIO_MASK_MASK17);
    case 18:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC18;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK18) == GPIO_MASK_MASK18);
    case 19:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC19;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK19) == GPIO_MASK_MASK19);
    case 20:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC20;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK20) == GPIO_MASK_MASK20);
    case 21:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC21;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK21) == GPIO_MASK_MASK21);
    case 22:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC22;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK22) == GPIO_MASK_MASK22);
    case 23:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC23;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK23) == GPIO_MASK_MASK23);
    case 24:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC24;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK24) == GPIO_MASK_MASK24);
    case 25:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC25;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK25) == GPIO_MASK_MASK25);
    case 26:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC26;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK26) == GPIO_MASK_MASK26);
    case 27:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC27;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK27) == GPIO_MASK_MASK27);
    case 28:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC28;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK28) == GPIO_MASK_MASK28);
    case 29:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC29;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK29) == GPIO_MASK_MASK29);
    case 30:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC30;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK30) == GPIO_MASK_MASK30);
    case 31:
        HWREG(ulBase + GPIO_O_MASKC) |= GPIO_MASKC_MASKC31;
        return((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK31) == GPIO_MASK_MASK31);
    default:
        break;
    }

    return(false);
}

//*****************************************************************************
//
//! Clear a GPIO interrupt.
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function clear gpio interrupt.
//!
//! \return Returns \b true if the clear operation is success and \b false
//! otherwise.
//
//*****************************************************************************
tBoolean
GPIOInterruptClear(unsigned long ulBase, unsigned long ulPinNumber)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    switch (ulPinNumber) {
    case 0:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC0;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG0) != GPIO_FLAG_FLAG0);
    case 1:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC1;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG1) != GPIO_FLAG_FLAG1);
    case 2:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC2;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG2) != GPIO_FLAG_FLAG2);
    case 3:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC3;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG3) != GPIO_FLAG_FLAG3);
    case 4:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC4;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG4) != GPIO_FLAG_FLAG4);
    case 5:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC5;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG5) != GPIO_FLAG_FLAG5);
    case 6:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC6;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG6) != GPIO_FLAG_FLAG6);
    case 7:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC7;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG7) != GPIO_FLAG_FLAG7);
    case 8:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC8;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG8) != GPIO_FLAG_FLAG8);
    case 9:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC9;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG9) != GPIO_FLAG_FLAG9);
    case 10:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC10;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG10) != GPIO_FLAG_FLAG10);
    case 11:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC11;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG11) != GPIO_FLAG_FLAG11);
    case 12:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC12;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG12) != GPIO_FLAG_FLAG12);
    case 13:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC13;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG13) != GPIO_FLAG_FLAG13);
    case 14:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC14;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG14) != GPIO_FLAG_FLAG14);
    case 15:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC15;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG15) != GPIO_FLAG_FLAG15);
    case 16:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC16;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG16) != GPIO_FLAG_FLAG16);
    case 17:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC17;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG17) != GPIO_FLAG_FLAG17);
    case 18:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC18;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG18) != GPIO_FLAG_FLAG18);
    case 19:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC19;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG19) != GPIO_FLAG_FLAG19);
    case 20:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC20;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG20) != GPIO_FLAG_FLAG20);
    case 21:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC21;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG21) != GPIO_FLAG_FLAG21);
    case 22:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC22;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG22) != GPIO_FLAG_FLAG22);
    case 23:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC23;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG23) != GPIO_FLAG_FLAG23);
    case 24:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC24;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG24) != GPIO_FLAG_FLAG24);
    case 25:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC25;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG25) != GPIO_FLAG_FLAG25);
    case 26:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC26;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG26) != GPIO_FLAG_FLAG26);
    case 27:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC27;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG27) != GPIO_FLAG_FLAG27);
    case 28:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC28;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG28) != GPIO_FLAG_FLAG28);
    case 29:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC29;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG29) != GPIO_FLAG_FLAG29);
    case 30:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC30;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG30) != GPIO_FLAG_FLAG30);
    case 31:
        HWREG(ulBase + GPIO_O_FLAGC) |= GPIO_FLAGC_FLAGC31;
        return((HWREG(ulBase + GPIO_O_FLAG) & GPIO_FLAG_FLAG31) != GPIO_FLAG_FLAG31);
    default:
        break;
    }

    return(false);
}

//*****************************************************************************
//
//! Set GPIO interrupt type.
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//! \parma ulInterruptType is the interrupt type of the GPIO pin
//!
//! This function set gpio interrupt type.
//!
//! \return Returns \b true if the clear operation is success and \b false
//! otherwise.
//
//*****************************************************************************
tBoolean
GPIOInterruptTypeSet(unsigned long ulBase, unsigned long ulPinNumber, unsigned long ulInterruptType)
{
    unsigned long ulGroupID;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));
    ASSERT((ulInterruptType == GPIO_FUNCTION_RAISEINT) ||
           (ulInterruptType == GPIO_FUNCTION_FALLINT)  ||
           (ulInterruptType == GPIO_FUNCTION_HIGHINT)  ||
           (ulInterruptType == GPIO_FUNCTION_LOWINT));

