harviswang/linux-3.10.99/arch/mips/m200/driverlib/gpio.c
    ulGroupID = GPIOGroupIDGet(ulBase);
    ASSERT(ulGroupID != -1);

    return(GPIOFunctionSet(ulBase, ulPinNumber, ulInterruptType));
}

//*****************************************************************************
//
//! \internal
//! Set GPIO function(raise interrupt function).
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function set gpio raise interrupt function type.
//!
//! \return Returns \b true if the raise interrupt function set operation is success and \b false
//! otherwise.
//
//*****************************************************************************
static tBoolean
GPIORaiseInterruptFunctionSet(unsigned long ulBase, unsigned long ulPinNumber)
{
    unsigned long ulGroupID;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    ulGroupID = GPIOGroupIDGet(ulBase);
    ASSERT(ulGroupID != -1);

    switch (ulPinNumber) {

    default:
        return(false);
    }
}


//*****************************************************************************
//
//! \internal
//! Set GPIO function( function).
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function set gpio raise interrupt function type.
//!
//! \return Returns \b true if the raise interrupt function set operation is success and \b false
//! otherwise.
//
//*****************************************************************************
static tBoolean
GPIOFallingInterruptFunctionSet(unsigned long ulBase, unsigned long ulPinNumber)
{
    unsigned long ulGroupID;

    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    ulGroupID = GPIOGroupIDGet(ulBase);
    ASSERT(ulGroupID != -1);

    switch (ulPinNumber) {
    case 0:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS0;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC0;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S0;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C0;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT0)   == GPIO_INT_INT0)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK0) != GPIO_MASK_MASK0) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT10) == GPIO_PAT1_PAT10) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT00) != GPIO_PAT0_PAT00));
    case 1:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS1;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC1;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S1;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C1;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT1)   == GPIO_INT_INT1)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK1) != GPIO_MASK_MASK1) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT11) == GPIO_PAT1_PAT11) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT01) != GPIO_PAT0_PAT01));
    case 2:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS2;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC2;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S2;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C2;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT2)   == GPIO_INT_INT2)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK2) != GPIO_MASK_MASK2) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT12) == GPIO_PAT1_PAT12) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT02) != GPIO_PAT0_PAT02));
    case 3:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS3;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC3;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S3;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C3;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT3)   == GPIO_INT_INT3)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK3) != GPIO_MASK_MASK3) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT13) == GPIO_PAT1_PAT13) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT03) != GPIO_PAT0_PAT03));
    case 4:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS4;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC4;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S4;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C4;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT4)   == GPIO_INT_INT4)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK4) != GPIO_MASK_MASK4) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT14) == GPIO_PAT1_PAT14) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT04) != GPIO_PAT0_PAT04));
    case 5:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS5;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC5;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S5;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C5;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT5)   == GPIO_INT_INT5)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK5) != GPIO_MASK_MASK5) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT15) == GPIO_PAT1_PAT15) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT05) != GPIO_PAT0_PAT05));
    case 6:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS6;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC6;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S6;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C6;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT6)   == GPIO_INT_INT6)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK6) != GPIO_MASK_MASK6) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT16) == GPIO_PAT1_PAT16) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT06) != GPIO_PAT0_PAT06));
    case 7:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS7;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC7;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S7;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C7;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT7)   == GPIO_INT_INT7)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK7) != GPIO_MASK_MASK7) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT17) == GPIO_PAT1_PAT17) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT07) != GPIO_PAT0_PAT07));
    case 8:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS8;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC8;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S8;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C8;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT8)   == GPIO_INT_INT8)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK8) != GPIO_MASK_MASK8) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT18) == GPIO_PAT1_PAT18) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT08) != GPIO_PAT0_PAT08));
    case 9:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS9;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC9;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S9;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C9;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT9)   == GPIO_INT_INT9)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK9) != GPIO_MASK_MASK9) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT19) == GPIO_PAT1_PAT19) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT09) != GPIO_PAT0_PAT09));
    case 10:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS10;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC10;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S10;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C10;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT10)   == GPIO_INT_INT10)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK10) != GPIO_MASK_MASK10) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT110) == GPIO_PAT1_PAT110) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT010) != GPIO_PAT0_PAT010));
    case 11:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS11;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC11;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S11;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C11;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT11)   == GPIO_INT_INT11)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK11) != GPIO_MASK_MASK11) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT111) == GPIO_PAT1_PAT111) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT011) != GPIO_PAT0_PAT011));
    case 12:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS12;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC12;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S12;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C12;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

