harviswang/linux-3.10.99/arch/mips/m200/driverlib/gpio.c
        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT12)   == GPIO_INT_INT12)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK12) != GPIO_MASK_MASK12) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT112) == GPIO_PAT1_PAT112) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT012) != GPIO_PAT0_PAT012));
    case 13:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS13;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC13;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S13;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C13;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT13)   == GPIO_INT_INT13)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK13) != GPIO_MASK_MASK13) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT113) == GPIO_PAT1_PAT113) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT013) != GPIO_PAT0_PAT013));
    case 14:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS14;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC14;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S14;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C14;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT14)   == GPIO_INT_INT14)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK14) != GPIO_MASK_MASK14) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT114) == GPIO_PAT1_PAT114) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT014) != GPIO_PAT0_PAT014));
    case 15:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS15;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC15;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S15;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C15;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT15)   == GPIO_INT_INT15)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK15) != GPIO_MASK_MASK15) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT115) == GPIO_PAT1_PAT115) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT015) != GPIO_PAT0_PAT015));
    case 16:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS16;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC16;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S16;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C16;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT16)   == GPIO_INT_INT16)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK16) != GPIO_MASK_MASK16) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT116) == GPIO_PAT1_PAT116) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT016) != GPIO_PAT0_PAT016));
    case 17:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS17;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC17;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S17;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C17;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT17)   == GPIO_INT_INT17)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK17) != GPIO_MASK_MASK17) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT117) == GPIO_PAT1_PAT117) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT017) != GPIO_PAT0_PAT017));
    case 18:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS18;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC18;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S18;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C18;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT18)   == GPIO_INT_INT18)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK18) != GPIO_MASK_MASK18) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT118) == GPIO_PAT1_PAT118) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT018) != GPIO_PAT0_PAT018));
    case 19:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS19;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC19;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S19;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C19;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT19)   == GPIO_INT_INT19)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK19) != GPIO_MASK_MASK19) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT119) == GPIO_PAT1_PAT119) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT019) != GPIO_PAT0_PAT019));
    case 20:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS20;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC20;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S20;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C20;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT20)   == GPIO_INT_INT20)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK20) != GPIO_MASK_MASK20) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT120) == GPIO_PAT1_PAT120) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT020) != GPIO_PAT0_PAT020));
    case 21:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS21;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC21;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S21;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C21;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT21)   == GPIO_INT_INT21)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK21) != GPIO_MASK_MASK21) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT121) == GPIO_PAT1_PAT121) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT021) != GPIO_PAT0_PAT021));
    case 22:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS22;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC22;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S22;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C22;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT22)   == GPIO_INT_INT22)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK22) != GPIO_MASK_MASK22) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT122) == GPIO_PAT1_PAT122) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT022) != GPIO_PAT0_PAT022));
    case 23:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS23;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC23;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S23;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C23;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT23)   == GPIO_INT_INT23)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK23) != GPIO_MASK_MASK23) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT123) == GPIO_PAT1_PAT123) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT023) != GPIO_PAT0_PAT023));
    case 24:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS24;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC24;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S24;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C24;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT24)   == GPIO_INT_INT24)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK24) != GPIO_MASK_MASK24) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT124) == GPIO_PAT1_PAT124) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT024) != GPIO_PAT0_PAT024));
    case 25:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS25;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC25;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S25;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C25;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT25)   == GPIO_INT_INT25)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK25) != GPIO_MASK_MASK25) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT125) == GPIO_PAT1_PAT125) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT025) != GPIO_PAT0_PAT025));
    case 26:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS26;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC26;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S26;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C26;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

