harviswang/linux-3.10.99/arch/mips/m200/driverlib/gpio.c
        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT26)   == GPIO_INT_INT26)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK26) != GPIO_MASK_MASK26) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT126) == GPIO_PAT1_PAT126) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT026) != GPIO_PAT0_PAT026));
    case 27:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS27;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC27;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S27;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C27;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT27)   == GPIO_INT_INT27)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK27) != GPIO_MASK_MASK27) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT127) == GPIO_PAT1_PAT127) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT027) != GPIO_PAT0_PAT027));
    case 28:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS28;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC28;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S28;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C28;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT28)   == GPIO_INT_INT28)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK28) != GPIO_MASK_MASK28) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT128) == GPIO_PAT1_PAT128) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT028) != GPIO_PAT0_PAT028));
    case 29:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS29;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC29;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S29;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C29;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT29)   == GPIO_INT_INT29)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK29) != GPIO_MASK_MASK29) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT129) == GPIO_PAT1_PAT129) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT029) != GPIO_PAT0_PAT029));
    case 30:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS30;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC30;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S30;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C30;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT30)   == GPIO_INT_INT30)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK30) != GPIO_MASK_MASK30) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT130) == GPIO_PAT1_PAT130) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT030) != GPIO_PAT0_PAT030));
    case 31:
        HWREG(GPIOZ_BASE + GPIO_O_INTS)  |= GPIO_INTS_INTS31;
        HWREG(GPIOZ_BASE + GPIO_O_MASKC) |= GPIO_MASKC_MASKC31;
        HWREG(GPIOZ_BASE + GPIO_O_PAT1S) |= GPIO_PAT1S_PAT1S31;
        HWREG(GPIOZ_BASE + GPIO_O_PAT0C) |= GPIO_PAT0C_PAT0C31;
        HWREG(GPIOZ_BASE + GPIO_O_PGZIDLD) = ulGroupID;

        return(((HWREG(ulBase + GPIO_O_INT)  & GPIO_INT_INT31)   == GPIO_INT_INT31)   &&
               ((HWREG(ulBase + GPIO_O_MASK) & GPIO_MASK_MASK31) != GPIO_MASK_MASK31) &&
               ((HWREG(ulBase + GPIO_O_PAT1) & GPIO_PAT1_PAT131) == GPIO_PAT1_PAT131) &&
               ((HWREG(ulBase + GPIO_O_PAT0) & GPIO_PAT0_PAT031) != GPIO_PAT0_PAT031));
    default:
        return(false);
    }
}

//*****************************************************************************
//
//! Set GPIO function.
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//! \parma ulFunction is the function type of the GPIO pin
//!
//! This function set gpio function type.
//!
//! \return Returns \b true if the function set operation is success and \b false
//! otherwise.
//
//*****************************************************************************
tBoolean
GPIOFunctionSet(unsigned long ulBase, unsigned long ulPinNumber, unsigned long ulFunction)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));
    ASSERT((ulFunction == GPIO_FUNCTION_RAISEINT) ||
           (ulFunction == GPIO_FUNCTION_FALLINT)  ||
           (ulFunction == GPIO_FUNCTION_HIGHINT)  ||
           (ulFunction == GPIO_FUNCTION_LOWINT)   ||

           (ulFunction == GPIO_FUNCTION_INTPUT)   ||

           (ulFunction == GPIO_FUNCTION_OUTPUT1)  ||
           (ulFunction == GPIO_FUNCTION_OUTPUT0)  ||

           (ulFunction == GPIO_FUNCTION_DEVICE3)  ||
           (ulFunction == GPIO_FUNCTION_DEVICE2)  ||
           (ulFunction == GPIO_FUNCTION_DEVICE1)  ||
           (ulFunction == GPIO_FUNCTION_DEVICE0)  ||

           (ulFunction == GPIO_FUNCTION_RAISEINTM)||
           (ulFunction == GPIO_FUNCTION_FALLINTM) ||
           (ulFunction == GPIO_FUNCTION_HIGHINTM) ||
           (ulFunction == GPIO_FUNCTION_LOWINTM));

    switch(ulFunction) {
    case GPIO_FUNCTION_RAISEINT:
        return(GPIORaiseInterruptFunctionSet(ulBase, ulPinNumber));
    case GPIO_FUNCTION_FALLINT:
        return(GPIOFallingInterruptFunctionSet(ulBase, ulPinNumber));
/*
    case GPIO_FUNCTION_HIGHINT:
        return(GPIOHighInterruptFunctionSet(ulBase, ulPinNumber));
    case GPIO_FUNCTION_LOWINT:
        return(GPIOLowInterruptFunctionSet(ulBase, ulPinNumber));
*/
    default:
        return(false);
    }
}

//*****************************************************************************
//
//! Get GPIO number base(the first gpio number in a gpio port).
//!
//! \param ulBase is the base address of the GPIO port.
//!
//! This function get gpio base number.
//!
//! \return Returns gpio base number
//
//*****************************************************************************
unsigned long
GPIONumberBaseGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));

    switch (ulBase) {
    case GPIOA_BASE:
        return(0);
    case GPIOB_BASE:
        return(32);
    case GPIOC_BASE:
        return(64);
    case GPIOD_BASE:
        return(96);
    case GPIOE_BASE:
        return(128);
    case GPIOF_BASE:
        return(160);
    default:
        return(-1);
    }
}

//*****************************************************************************
//
//! Get GPIO base by gpio base number(revert of GPIONumberBaseGet).
//!
//! \param ulNumberBase is the base address of the GPIO port.
//!
//! This function get gpio memory base by gpio number number.
//!
//! \return Returns gpio memory base
//
//*****************************************************************************
unsigned long
GPIOBaseGet(unsigned long ulNumberBase)
{
    //
    // Check the arguments.
    //
    ASSERT((ulNumberBase == 0)   ||
           (ulNumberBase == 32)  ||
           (ulNumberBase == 64)  ||
           (ulNumberBase == 96)  ||
           (ulNumberBase == 128) ||
           (ulNumberBase == 160));

    switch (ulNumberBase) {
    case 0:
        return(GPIOA_BASE);
    case 32:
        return(GPIOB_BASE);
    case 64:
        return(GPIOC_BASE);
    case 96:
        return(GPIOD_BASE);
    case 128:
        return(GPIOE_BASE);
    case 160:
        return(GPIOF_BASE);
    default:
        return(-1);
    }
}

//*****************************************************************************
//
//! Get GPIO number base(the first gpio number in a gpio port).
//!
//! \param ulBase is the base address of the GPIO port.
//! \param ulPinNumber is the number of the GPIO pin.
//!
//! This function get gpio base number.
//!
//! \return Returns gpio base number
//
//*****************************************************************************
unsigned long
GPIOPinLevelGet(unsigned long ulBase, unsigned long ulPinNumber)
{
    //
    // Check the arguments.
    //
    ASSERT(GPIOBaseValid(ulBase));
    ASSERT(GPIOPinNumberValid(ulPinNumber));

    switch (ulPinNumber) {
    case 0:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL0) == GPIO_PIN_PNL0);
    case 1:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL1) == GPIO_PIN_PNL1);
    case 2:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL2) == GPIO_PIN_PNL2);
    case 3:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL3) == GPIO_PIN_PNL3);
    case 4:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL4) == GPIO_PIN_PNL4);
    case 5:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL5) == GPIO_PIN_PNL5);
    case 6:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL6) == GPIO_PIN_PNL6);
    case 7:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL7) == GPIO_PIN_PNL7);
    case 8:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL8) == GPIO_PIN_PNL8);
    case 9:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL9) == GPIO_PIN_PNL9);
    case 10:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL10) == GPIO_PIN_PNL10);
    case 11:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL11) == GPIO_PIN_PNL11);
    case 12:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL12) == GPIO_PIN_PNL12);
    case 13:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL13) == GPIO_PIN_PNL13);
    case 14:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL14) == GPIO_PIN_PNL14);
    case 15:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL15) == GPIO_PIN_PNL15);
    case 16:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL16) == GPIO_PIN_PNL16);
    case 17:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL17) == GPIO_PIN_PNL17);
    case 18:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL18) == GPIO_PIN_PNL18);
    case 19:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL19) == GPIO_PIN_PNL19);
    case 20:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL20) == GPIO_PIN_PNL20);
    case 21:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL21) == GPIO_PIN_PNL21);
    case 22:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL22) == GPIO_PIN_PNL22);
    case 23:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL23) == GPIO_PIN_PNL23);
    case 24:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL24) == GPIO_PIN_PNL24);
    case 25:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL25) == GPIO_PIN_PNL25);
    case 26:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL26) == GPIO_PIN_PNL26);
    case 27:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL27) == GPIO_PIN_PNL27);
    case 28:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL28) == GPIO_PIN_PNL28);
    case 29:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL29) == GPIO_PIN_PNL29);
    case 30:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL30) == GPIO_PIN_PNL30);
    case 31:
        return((HWREG(ulBase + GPIO_O_PIN) & GPIO_PIN_PNL31) == GPIO_PIN_PNL31);
    default:
        return(-1);
    }
}
